/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include "ff.h"
#include "string.h"
#include "File_Handling.h"
#include <stdlib.h>
#include <stdarg.h>
#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <math.h>

#include "new_eeprom.h"
#include "new_rtc.h"
#include "new_uart.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/*	Change Start */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define DE_BUG 0

// for new_uart.c
#define RX_buffersize 256
#define EOP_string "EOP"

HAL_StatusTypeDef ret;
char temp[500];
uint8_t* dataread;


#define print(msg) \
    HAL_UART_Transmit(&huart3, (uint8_t *)(msg), sizeof(msg) - 1, HAL_MAX_DELAY)

#define HEADER_SIZE 44 // Size of the WAVE header
#define AUDIO_DATA_SIZE 32 // Size of the audio data (16 bytes in this case)

#define AUDIO_BUFFER_SIZE 2000  // Define the size of the audio buffer
#define DEFAULT_AUDIO_IN_FREQ 16000
#define WR_BUFFER_SIZE        4096
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;


// for new_eeprom.c new_rtc.c new_uart.c
I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s2;
I2S_HandleTypeDef hi2s3;
DMA_HandleTypeDef hdma_spi2_rx;
DMA_HandleTypeDef hdma_spi3_rx;

SD_HandleTypeDef hsd;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
HAL_StatusTypeDef I2S_Status;
typedef struct
{
  uint32_t   ChunkID;       /* 0 */
  uint32_t   FileSize;      /* 4 */
  uint32_t   FileFormat;    /* 8 */
  uint32_t   SubChunk1ID;   /* 12 */
  uint32_t   SubChunk1Size; /* 16*/
  uint16_t   AudioFormat;   /* 20 */
  uint16_t   NbrChannels;   /* 22 */
  uint32_t   SampleRate;    /* 24 */

  uint32_t   ByteRate;      /* 28 */
  uint16_t   BlockAlign;    /* 32 */
  uint16_t   BitPerSample;  /* 34 */
  uint32_t   SubChunk2ID;   /* 36 */
  uint32_t   SubChunk2Size; /* 40 */

}WAVE_FormatTypeDef;

typedef struct {
  int32_t offset;
  uint32_t fptr;
}Audio_BufferTypeDef;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_I2S2_Init(void);
static void MX_I2S3_Init(void);
static void MX_I2C2_Init(void);


// for new_eeprom.c new_rtc.c new_uart.c
static void MX_I2C1_Init(void);

void handle_recording(void);

/* USER CODE BEGIN PFP */
void I2C_CODEC_Settings(void);
void SD_Card(void);
void message(const char *format, ...);
void configure_codec(void);
void CODEC_RST(void);
void TS472IQT_EN(void);
void History_update(void);
